app/controllers/calculatos_controller.rb

  def index
    @calculatos = Calculato.all
---
SELECT "calculatos".* FROM "calculatos"

  def create
    @calculato = Calculato.new(calculato_params)

    respond_to do |format|
      if @calculato.save
---
INSERT INTO "calculatos" ("firstname", "firstnumber", "operator", "secondnumber", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["firstname", "musa"], ["firstnumber", 2], ["operator", "*"], ["secondnumber", 2], ["created_at", "2019-01-30 17:02:44.134840"], ["updated_at", "2019-01-30 17:02:44.134840"]]

    def set_calculato
      @calculato = Calculato.find(params[:id])
---
SELECT  "calculatos".* FROM "calculatos" WHERE "calculatos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]