app/controllers/turatsinzes_controller.rb

SELECT "turatsinzes".* FROM "turatsinzes"
---
  def index
    @turatsinzes = Turatsinze.all

INSERT INTO "turatsinzes" ("firstname", "lastname", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["firstname", "musa"], ["lastname", "rachid"], ["created_at", "2019-01-30 20:40:31.201954"], ["updated_at", "2019-01-30 20:40:31.201954"]]
---
  def create
    @turatsinze = Turatsinze.new(turatsinze_params)

    respond_to do |format|
      if @turatsinze.save

SELECT  "turatsinzes".* FROM "turatsinzes" WHERE "turatsinzes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_turatsinze
      @turatsinze = Turatsinze.find(params[:id])